package test6.amr.com.test6;

import android.content.Intent;
import android.os.Bundle;
import android.support.design.widget.AppBarLayout;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.Toolbar;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

import butterknife.Bind;
import butterknife.ButterKnife;

public class MainActivityprofile extends AppCompatActivity implements AppBarLayout.OnOffsetChangedListener {

    @Bind(R.id.toolbar_header_view)
    protected HeaderView toolbarHeaderView;

    @Bind(R.id.float_header_view)
    protected HeaderView floatHeaderView;

    @Bind(R.id.appbar)
    protected AppBarLayout appBarLayout;

    @Bind(R.id.toolbar)
    protected Toolbar toolbar;
    ListView t;

    private boolean isHideToolbarView = false;

    String one_title = "لو جالك عقد عمل فى الخليج";
    String one_situation = "فى حالة لو جالك شغل فى أى دولة خليجية بتكون محتاج شوية إجراءات تعملها فى الورق ، أولاً محتاج تستخرج شهادة التخرج بتاعتك من الجامعة بالعربى معتمدة من الجامعة وبعد كده تتوثق فى الخارجية لها كذا مكتب هتلاقيهم فى الرابط ده" +
            "http://www.mfa.gov.eg/Arabic/ConsularServices/TravelGuide/Ratifications/Pages/Default.aspx\n" +
            "بعد كده تروحبيها على سفارة الدولة المفروض هتشتغل فيها عشان توثقها" +
            "المكان اللى هتشتغل فيه بيكون طالب دائماً صورة ضوئية لشهادة التخرج معتمدة من الجامعة وموثقة من الخارجية ومن سفارتها\n" +
            "ملاحظات:" +
            "-ممكن لو أنت فى مرحلة البحث عن عمل تشتغل فى الإجراءات ديه عشان أما تجيلك فرصة تعرف تتحرك أسرع" +
            "- دولة الإمارات التوثيق بيكون على مرحلتين الأولى فى المحلق الثقافى للسفارة والتانى بيكون فى السفارة نفسها";
    String one_date = "2014-03-24";
    ///////////////////////////////////////////////////////////////////////////
    String two_title = "إذن السفر للخارج";
    String two_situation = "اي شخص حاصل على اعفاء مؤقت أو طالب أو تأجيل ومكتوب في الشهاده اللي معاه انه غير مصرح له بالسفر الا بإذن ممكن ياخد اذن من منطقه التجنيد التابع ليها بمنتهى السهوله وبياخدها في نفس اليوم كمان" +
            "إذن السفر للخارج : اي شخص حاصل على اعفاء مؤقت أو طالب أو تأجيل ومكتوب في الشهاده اللي معاه انه غير مصرح له بالسفر الا بإذن ممكن ياخد اذن من منطقه التجنيد التابع ليها بمنتهى السهوله وبياخدها في نفس اليوم كمان الاوراق المطلوبه للحصول على إذن السفر بالخارج : 1- عدد 2 صورة من الباسبور 2- صورة واحده من التأشيره 3- صورة واحده من البطاقه 4- صورة واحده من شهاده الموقف التجنيدي سواء اعفاء مؤقت أو تأجيل 5- بون اسمه بون اذونات سفر للخارج بتجيبه من داخل منطقه التجنيد بجوار مكتب الحصول على إذن بالسفر للخارج وقيمه البون بتختلف حسب السنه اللي اتولدت فيها بس السعر بيتراوح من 15 جنيه لحد 40 جنيه بالكتير أوي 6- يفضل لو معاك أصل لشهاده موقفك التجنيدي احتياطي فقط لا غير لكن مش ضروري أوي اما بالنسبه للطلبه : الاوراق المطلوبه للحصول على إذن السفر بالخارج في اجازة نصف العام أو اجازة أخر العام الدراسي : 1- عدد 2 صورة من الباسبور 2- صورة واحده من التأشيره 3- صورة واحده من البطاقه 4- شهادة قيد من الكليه أو المعهد اللي بتدرس فيه 5- بون اسمه بون اذونات سفر للخارج بتجيبه من داخل منطقه التجنيد بجوار مكتب الحصول على إذن بالسفر للخارج وقيمه البون بتختلف حسب السنه اللي اتولدت فيها بس السعر بيتراوح من 15 جنيه لحد 40 جنيه بالكتير أو الخطوات المطلوبه للحصول على اذن السفر للخارج : بمنتهى البساطه بتروح الاول بتسأل داخل منطقه التجنيد على الشباك بتاع اذن السفر للخارج حتلاقيه وحتلاقي جنبه الشباك بتاع الخزنه اللي حتجيب منه بون اذونات السفر للخارج روح الأول لشباك الخزنه واشتري منه بون اذونات السفر للخارج وحتلاقيه حيديك بون للتصوير كمان عشان لو احتجت تصور اي ورق سواء الباسبور او البطاقه اوالتأشيره مسموحلك بالبون ده تصور من غير فلوس في ماكنه التصوير لموجوده بمنطقه التجنيد المهم بعد ما حيكون معاك البون والصور من الورق المطلوب روح لشباك اذن السفر للخارج واديه للموظف او الموظفه الموجوده حتقولك استريح شويه وحتنادي على اسمك في ربع ساعه بالكتير ومبروك عليك إذن السفر بالخارج";
    String two_date = "2013-05-19";
    ///////////////////////////////////////////////////////////////////////////
    String three_title = "فيزا أمريكا ";
    String three_situation = "احنا مجموعة من طلبة كلية الهندسة ... كان عندنا مسابقة في أمريكا... وروحنا نقدم على فيزا أمريكا... ومعانا كل الدعم والورق اللي يثبت ان حنا بنمثل الكية ومصر في المسابقة, وأنوا معانا دعم مادي لمشروع التخرج من شركات كبرى في اسكندرية... المهم دخلنا انترفيو جماعي بكل الورق ده... واترفضنا !! بعد كده قدمنا كل واحد لوحده وفي ناس خدتها بشوية النصايح اللي تحت دي" +
            "1-\tروح ادفع في ال CIB BANK مبلغ 1120 ج 2-\tكلم فودافون على 2100 عشان تحجز معاد، الدقيقة ب 5.05 ج ، تقريبا بتدوس 1 1 1 عشان تختصر 5 دقايق من التسجيل الصوتي وتكلم مندوب فودافون على طول ... لو انت طالع مسابقة أو مؤتمر ومعاك invitation letter قلهم عايز ميعاد business غالبا ده بيديك معاد أسرع من المواعيد العادية ..وبتكون ال visa type هو business 3-\tبتملى ال DS 160 FORM اللي هي الابليكشن من على ceac.state.gov/genniv 4-\tFor cancellation call 0225224890 قبل المعاد ب 48 ساعة على الأقل وتبقى تاخد معاد في وقت تاني عشان الحجز مايروحش عاليك 5-\tكون لابس كويس... احسن حاجة عندك.. مش شرط فورمال... عشان للاسف بيطروا يحكموا من ابمنظر...روح السفارة قبل معادك بنص ساعة وكون محضر كلامك كويس وواثق في نفسك في الانترفيو وخليك مبتسم وفريش وحاول يكون في كلامك بطريقة غير مباشرة ان في روابط قوية تربطك بالبلد وانك مش محتاجلهم في حاجة .. شوية انافة بتنفع برضوا ... الأهم من الورق اللي معاك ..طريقة كلامك وثقتك في الكلام اللي بتقولوا.. مش بعيد تسجل لنفسك انترفيوا وتظبطوا كذا مرة لحاد ما تتقنوا وتحضر نفسك لكل أنواع الأسئلة اللي ممكن تتسألها وردك يكون جاهز ووقتي عاليها بدون ما يكون في أي تناقضات في الردود.. الانترفيو ممكن مسعديش اريع دقايق...فقول اكتر جملتين تجذبهم عشان يدوك الفيزا أول جملتين.. فكرة الانطباع الاول مهمة جدا هنا" +
            "ملاحظات\n" +
            "* مفيش أي حد جوه السفارة نهائيا له يد في قرار الفيزا بتاعك غير القنصل اللي عالشباك ... متقلقش نفسك عالفاضي مع أي موظف تاني زي اللي بياخد منك الباسبورت أو اللي بيبصمك أو اللي بيتاكد ان اسمك موجود عندهم متسجل في اليوم ده وبيدبسلك الصورة في الباسبور... مش مهم تكون قلقان قدام دول كلهم ... المهم متكونش قلقان قدام القنصل اللي عالشباك" +
            "* لو انت اترفضت نصيحتي ليك قدم تاني على طول ...ده لو انت شايف ان حقك تسافر وكان قرار الرفض ظالم ليك.. لان في القانون عندهم مش حيكون نفس القنصل اللي عملك الانترفيو وحيبقى قنصل تاني ... مادام قدمت تاني قبل سنة من المعاد الاولاني ... دايما بيكون في قنصل معدل رفضه للفيزا ابليكيشن اعلى من غيره ..يعني هي مسألة حظوظ انت داخل على انهي قنصل... فلو كان حظك وحش ودخلت اول مرة لقنصل معدل رفضه لاعطاء الفيزا عالي... المرة اللي بعدها لو في خلال سنة مش حتخشله تاني... ولو دخلتله قله انو عملك انترفيو من 3 شهور مثلا فهو حيخليك تخش على شباك تاني وربنا يكرمك المره دي !" +

            "*اوعى ابدا تخش انترفيو جماعي الا لو معاك انفيتاشن او اسرة واحدة ... لأن القنصل يا أما حيديكوا كلكوا الفيزا أو يديكوا رفض و الاسهله 1000 مرة ان يرفضكوا كلكوا حتى لو هوا شاف ان واحد فيكوا بس يستحق الرفض...حيرفض المجموعة كلها... عشان كده دايما على قد ما تقدروا ابعدوا عن الجروب انترفيو !!";
    String three_date = "2013-05-10";
    ///////////////////////////////////////////////////////////////////////////
    String four_title = "فيزا انجلترا";
    String four_situation = "دي خطوات تضمن بيها انك تاخد فيزا انجلترا (سياحة) بكل سهولة ان شاء الله اول حاجة عايز اقولها ان الفيزا اسهل كتير انك طالب في كلية .. لان ببساطة دة يعتبر اثبات قوي انك مرتبط بالبلد و احتمال هروبك بيقل وطبعا كل ما كنت في السنوات الاولى من الدراسة بيبقى افضل (ودة بينطبق على كل السفارات مش سفارة انجلترا بس. فيزا انجلترا بتدخلك انجلترا و اسكتلندا و ايرلندا و ويلز ( المملكة المتحدة) مفيش انترفيو عشان تاخد الفيزا الا في حدود ضيقة جدا ممكن نقول نسبة 1% بس في الاساس مفيش انترفيو الورق اللي مطلوب: 1-تملى الابلكيشن من هنا https://www.visa4uk.fco.gov.uk/ وبعد ما تملاه لازم تدفع اون لاين عشان تقدر تطبعه وتاخده معاك و انت بتقدم .. طبعا هتحتاج انترنت كارد عشان تدفع (سعر الفيزا وقت كتابة الخبرة دي 132 دولار). 2-بعد ما تدفع هتدخل على الموقع دة عشان تحجز معاد للمقابلة https://www.visainfoservices.com/ . 3- هتطلع شهادة قيد لو كنت طالب .. او ورق من شغلك بمرتبك لو كنت بتشتغل.. او بطاقتك الضريبية والسجل التجاري لو كنت صاحب عمل. 4- بنك ستيتمنت (كشف حساب) و دة مهم جدا لانه بيبين هتقدر تغطي مصاريفك هناك ولا لا. لو طالب ممكن 30 الف جنيه كافيين جدا في كشف الحساب .. في الحالات التانية مش عارف بالظبط بس اكيد لو اكتر احسن بكتير. 5-طبعا كل الورق دة يا اما يطلع انجليزي اصلا يا اما لازم تترجمه ومش لازم ترجمة معتمدة (كنت بترجمه بنفسي عالسرير واروح بيه عادي) 7-صورتين 4 في 6 خلفية بيضا زي بتاعت الباسبور. وتاخد بعضك وتروح على مكتب الوورلد بردج هتسلم ورقك وباسبورك وياخدوا بصمتك وهتستنى باسبورك هيجيلك بالدي اتش ال وعليه الفيزا ان شاء الله..";
    String four_date = "2013-05-16";
    /////////////////////////////////////////////////////////////////////////

    String[] Name = {one_title, two_title, three_title, four_title};
    String[] Date = {one_date, two_date, three_date, four_date};
    String[] Description = {one_situation, two_situation, three_situation, four_situation};
    int[] Image = {R.drawable.wallpaper, R.drawable.wallpaper, R.drawable.wallpaper, R.drawable.wallpaper};







    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main_profile);
        ButterKnife.bind(this);

        t= (ListView) findViewById(R.id.listView);

        setSupportActionBar(toolbar);
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        t.setAdapter(new MAdapterProfile(this, Name, Date, Description));
        t.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                Intent i = new Intent(MainActivityprofile.this, ReviewsPopUp.class);
                i.putExtra("name", Name[position]);
                i.putExtra("date", Date[position]);
                i.putExtra("description", Description[position]);
                startActivity(i);
            }
        });

        initUi();
    }

    private void initUi() {
        appBarLayout.addOnOffsetChangedListener(this);

        toolbarHeaderView.bindTo("Sherif Mohi", "Last seen today at 7.00PM");
        floatHeaderView.bindTo("Sherif Mohi", "Last seen today at 7.00PM");
    }

    @Override
    public void onOffsetChanged(AppBarLayout appBarLayout, int offset) {
        int maxScroll = appBarLayout.getTotalScrollRange();
        float percentage = (float) Math.abs(offset) / (float) maxScroll;

        if (percentage == 1f && isHideToolbarView) {
            toolbarHeaderView.setVisibility(View.VISIBLE);
            isHideToolbarView = !isHideToolbarView;

        } else if (percentage < 1f && !isHideToolbarView) {
            toolbarHeaderView.setVisibility(View.GONE);
            isHideToolbarView = !isHideToolbarView;
        }
    }
}
